import { StudentRequestType } from '@/types'

export const studentRequests: StudentRequestType[] = [
	{
		id: '13245',
		thesisId: '2139081',

		date: '30/02/2024',
		teacherName: 'Παναγιώτης Τσανάκας',
		thesisTitle:
			'Ανάπτυξη αλγορίθμων για τη δέσμευση δικτυακών και υπολογιστικών πόρων για την εξυπηρέτηση των εφαρμογών βάση των προθέσεών τους ',
	},
	{
		id: '13245',
		thesisId: '2139081',
		date: '30/02/2024',
		teacherName: 'Παναγιώτης Τσανάκας',
		thesisTitle:
			'Ανάπτυξη αλγορίθμων για τη δέσμευση δικτυακών και υπολογιστικών πόρων για την εξυπηρέτηση των εφαρμογών βάση των προθέσεών τους ',
	},
	{
		id: '13245',
		thesisId: '2139081',
		date: '30/02/2024',
		teacherName: 'Παναγιώτης Τσανάκας',
		thesisTitle:
			'Ανάπτυξη αλγορίθμων για τη δέσμευση δικτυακών και υπολογιστικών πόρων για την εξυπηρέτηση των εφαρμογών βάση των προθέσεών τους ',
	},
	{
		id: '13245',
		thesisId: '2139081',

		date: '30/02/2024',
		teacherName: 'Παναγιώτης Τσανάκας',
		thesisTitle:
			'Ανάπτυξη αλγορίθμων για τη δέσμευση δικτυακών και υπολογιστικών πόρων για την εξυπηρέτηση των εφαρμογών βάση των προθέσεών τους ',
	},
	{
		id: '13245',
		thesisId: '2139081',

		date: '30/02/2024',
		teacherName: 'Παναγιώτης Τσανάκας',
		thesisTitle:
			'Ανάπτυξη αλγορίθμων για τη δέσμευση δικτυακών και υπολογιστικών πόρων για την εξυπηρέτηση των εφαρμογών βάση των προθέσεών τους ',
	},
	{
		id: '13245',
		thesisId: '2139081',

		date: '30/02/2024',
		teacherName: 'Παναγιώτης Τσανάκας',
		thesisTitle:
			'Ανάπτυξη αλγορίθμων για τη δέσμευση δικτυακών και υπολογιστικών πόρων για την εξυπηρέτηση των εφαρμογών βάση των προθέσεών τους ',
	},
	{
		id: '13245',
		thesisId: '2139081',

		date: '30/02/2024',
		teacherName: 'Παναγιώτης Τσανάκας',
		thesisTitle:
			'Ανάπτυξη αλγορίθμων για τη δέσμευση δικτυακών και υπολογιστικών πόρων για την εξυπηρέτηση των εφαρμογών βάση των προθέσεών τους ',
	},
	{
		id: '13245',
		thesisId: '2139081',

		date: '30/02/2024',
		teacherName: 'Παναγιώτης Τσανάκας',
		thesisTitle:
			'Ανάπτυξη αλγορίθμων για τη δέσμευση δικτυακών και υπολογιστικών πόρων για την εξυπηρέτηση των εφαρμογών βάση των προθέσεών τους ',
	},
]
