import React from 'react'
import { Accordion, AccordionContent, AccordionItem, AccordionTrigger } from '@/components/ui/accordion'

type Props = {}

const ThesisRule = (props: Props) => {
	return (
		<Accordion type='single' collapsible className='w-full my-4'>
			<AccordionItem value='item-1'>
				<AccordionTrigger>Ανάθεση Διπλωματικής</AccordionTrigger>
				<AccordionContent>
					<ul className='ml-6 list-disc [&>li]:mt-2'>
						<li>
							Σύμφωνα με τον Εσωτερικό Κανονισμό του Εθνικού Μετσόβιου Πολυτεχνείου (ΕΚΕΜΠ) , οι Δ.Ε. έχουν
							τύποις και ουσία το περιεχόμενο και την ελάχιστη διάρκεια (ένα πλήρες ακαδημαϊκό εξάμηνο, το 10ο)
							μιας εργασίας υψηλού επιπέδου, με την οποία ολοκληρώνεται και η εξειδίκευση που παρέχει η Σχολή
							Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών (ΣΗΜΜΥ), μέσω των μαθημάτων κατεύθυνσης, στα
							τελευταία εξάμηνα των Σπουδών της.
						</li>
						<li>
							Η Δ.Ε. εκπονείται από τους τελειόφοιτους φοιτητές σε Τομέα και γνωστικό αντικείμενο της επιλογής
							τους, εντός ή στην ευρύτερη περιοχή του Τομέα, υπό την εποπτεία μέλους ΔΕΠ του Τομέα που διδάσκει
							το συγγενέστερο μάθημα. Επί της ουσίας, ο καθορισμός του θέματος και η συνακόλουθη ανάθεση Δ.Ε.
							πραγματοποιούνται : <br /> i. Με επιλογή θέματος από τον φοιτητή μέσα από κατάλογο συγκεκριμένων
							θεμάτων, που ανακοινώνει το κάθε μέλος ΔΕΠ στην αρχή του κάθε ακαδημαϊκού εξαμήνου. Τα διαθέσιμα
							θέματα των Δ.Ε. αναρτώνται σε ειδική ιστοσελίδα της Σχολής και στις ιστοσελίδες των Εργαστηρίων
							της Σχολής, προκειμένου να έχουν πρόσβαση όλοι οι φοιτητές σε αυτά. <br />
							ii. Με κατάθεση του συμπληρωμένου και υπογεγραμμένου από το επιβλέπον μέλος ΔΕΠ και τον
							ενδιαφερόμενο φοιτητή σχετικού εγγράφου ανάθεσης Δ.Ε. στη Γραμματεία της Σχολής, στο οποίο
							ορίζονται και τα μέλη της τριμελούς επιτροπής εξέτασης.
						</li>
						<li>
							Κάθε μέλος ΔΕΠ. έχει δικαίωμα και υποχρέωση επίβλεψης Δ.Ε. στην περιοχή των μαθημάτων που
							διδάσκει και σε συναφή επιστημονικά πεδία.
						</li>
						<li>
							Την επίβλεψη Δ.Ε. φοιτητή στης ΣΗΜΜΥ μπορεί να αναλάβει μέλος ΔΕΠ του ΕΜΠ που είναι διδάσκον στο
							προπτυχιακό πρόγραμμα σπουδών της ΣΗΜΜΥ. Στην τριμελή επιτροπή εξέτασης μετέχουν τουλάχιστον δύο
							μέλη ΔΕΠ από τη ΣΗΜΜΥ με δυνατότητα το τρίτο μέλος να είναι μέλος ΔΕΠ άλλης Σχολής του ΕΜΠ ή
							άλλου Πανεπιστημίου.
						</li>
						<li>
							Δεδομένου ότι ένας από τους κύριους στόχους της Δ.Ε. είναι η ανάπτυξη της πρωτοβουλίας του
							φοιτητή, η εκπόνησή της γίνεται ατομικά από τον κάθε φοιτητή ή, αν το απαιτεί η φύση του θέματος
							και κατ’ εξαίρεση πλήρως αιτιολογημένη, από ομάδα φοιτητών υπό την προϋπόθεση ότι είναι διακριτή
							η ατομική εργασία και συμβολή τόσο κατά την εκπόνηση όσο και κατά την παρουσίαση. Η έκταση του
							θέματος πρέπει να είναι τέτοια, ώστε η ολοκλήρωσή του να είναι καταρχήν εφικτή μέσα σε ένα
							ακαδημαϊκό εξάμηνο πλήρους εργασίας του φοιτητή, αν και ο πραγματικός χρόνος ολοκλήρωσης
							εξαρτάται από την ανταπόκριση στις απαιτήσεις του θέματος και το βαθμό απασχόλησης. Το σύνολο των
							εκτιμώμενων ωρών συστηματικής απασχόλησης πρέπει να είναι της τάξεως των 600 ανά φοιτητή.
						</li>

						<li>
							Η ανάθεση Δ.Ε. μπορεί να γίνει το ενωρίτερο στην αρχή του 9ου εξαμήνου και μόνο κατά τη διάρκεια
							των εγγραφών, υπό την προϋπόθεση ότι ο φοιτητής δεν οφείλει περισσότερα των 7 μαθημάτων του
							κανονικού προγράμματος σπουδών.
						</li>
					</ul>
				</AccordionContent>
			</AccordionItem>
			<AccordionItem value='item-2'>
				<AccordionTrigger>Εκπόνηση, παράδοση και εξέταση της διπλωματικής εργασίας</AccordionTrigger>
				<AccordionContent>
					<ul className='ml-6 list-disc [&>li]:mt-2'>
						<li>
							Η Δ.Ε. εκπονείται με ευθύνη του φοιτητή, με τη συνεχή παρακολούθηση - βοήθεια του επιβλέποντος. Ο
							Τομέας καλύπτει με ευθύνη του την απρόσκοπτη εκπόνηση και παρουσίαση των Δ.Ε., με τα μέσα που
							διαθέτει και, αν χρειαστεί, σε συνεργασία με την εκτυπωτική μονάδα του Ιδρύματος.
						</li>
						<li>
							Η παρουσίαση και εξέταση Δ.Ε. γίνεται αποκλειστικά κατά τη διάρκεια των εξεταστικών περιόδων
							Ιουνίου, Σεπτεμβρίου και Φεβρουαρίου, με βάση αναλυτικό πρόγραμμα εξετάσεων Δ.Ε. που αναρτά ο
							αρμόδιος Τομέας και είναι ανοικτή σε όλους τους ενδιαφερομένους (σπουδαστές, άλλα μέλη ΔΕΠ,
							συγγενείς των εξεταζομένων).
						</li>
						<li>
							Η εξέταση πραγματοποιείται μετά την επιτυχή ολοκλήρωση όλων των άλλων υποχρεώσεων του Π.Π.Σ. από
							τον φοιτητή και την κατάθεση της Δ.Ε. και της περίληψής της στο σύστημα ηλεκτρονικής
							αρχειοθέτησης της Σχολής (ΑΡΤΕΜΙΣ), ώστε η Γραμματεία να παραδώσει, στη συνέχεια, το σχετικό
							έγγραφο ανάθεσης στο επιβλέπον μέλος ΔΕΠ για την πραγματοποίηση της εξέτασης.
						</li>
						<li>
							Μεταξύ της ανάθεσης και της εξέτασης της Δ.Ε., μεσολαβεί ένα τουλάχιστον ακαδημαϊκό εξάμηνο
							σπουδών, όπως αυτό ορίζεται από το εγκεκριμένο από τη Σύγκλητο του Ιδρύματος ακαδημαϊκό
							ημερολόγιο.
						</li>
						<li>
							Η Δ.Ε. συγγράφεται στην ελληνική γλώσσα. Ο φοιτητής μπορεί παράλληλα να καταθέσει στην τριμελή
							επιτροπή εξέτασης προς έγκριση και αγγλικό κείμενο, αν το επιθυμεί. Η τριμελής επιτροπή εξετάζει
							το κείμενο της διπλωματικής ως προς την πληρότητα, την αυτοτέλεια και τη δομή του, καθώς και το
							προαιρετικό αγγλικό κείμενο και στη συνέχεια προτείνει διορθώσεις, αν χρειάζεται, πριν την
							ανάρτηση των κειμένων στο σύστημα ηλεκτρονικής αρχειοθέτησης της Σχολής ΑΡΤΕΜΙΣ.
						</li>

						<li>
							Μετά το πέρας της εξέτασης, το επιβλέπον μέλος ΔΕΠ εγκρίνει στο σύστημα ΑΡΤΕΜΙΣ την τελική έκδοση
							του κειμένου που έχει υποβάλει ο φοιτητής (κατόπιν πιθανών διορθώσεων μετά από υπόδειξη της
							τριμελούς επιτροπής εξέτασης) και καταθέτει στη γραμματεία το έγγραφο ανάθεσης/πρακτικό εξέτασης
							με την τελική βαθμολογία.
						</li>
						<li>
							Το κείμενο της παρουσίασης της Δ.Ε. συντίθεται σε λογότυπο της έγκρισης της Γ.Σ. της Σχολής, και
							πρέπει να περιλαμβάνει και τα εξής: <br /> Περίληψη (300 έως 500 λέξεων) στην Ελληνική και στην
							Αγγλική.
							<br />
							Πίνακα περιεχομένων.
							<br />
							Βιβλιογραφικές αναφορές.{' '}
						</li>
						<li>Για την παρουσίαση της κάθε εργασίας διατίθενται κατ’ ελάχιστο 30 λεπτά. </li>
						<li>
							Φοιτητής που κρίνεται ότι δεν επέτυχε στις προφορικές εξετάσεις της Δ.Ε. μπορεί να υποστεί μια
							ακόμα φορά την εξέταση αυτή σε επόμενη περίοδο, μετά από αίτησή του. Αν αποτύχει και δεύτερη
							φορά, ο φοιτητής με αίτησή του ζητά νέο θέμα στην ίδια ή άλλη περιοχή, προκειμένου να εξεταστεί
							σε επόμενη περίοδο εξετάσεων Δ.Ε..{' '}
						</li>
					</ul>{' '}
				</AccordionContent>
			</AccordionItem>
			<AccordionItem value='item-3'>
				<AccordionTrigger>Κριτήρια Αξιολόγησης και Βαθμολογία Δ.Ε.</AccordionTrigger>
				<AccordionContent>
					Για την αξιολόγηση της Δ.Ε. συνεκτιμώνται τα παρακάτω κριτήρια:
					<ul className='ml-6 list-disc [&>li]:mt-2'>
						<li>Η ενημέρωση στην υπάρχουσα γνώση με αντίστοιχη βιβλιογραφική διερεύνηση.</li>
						<li>
							Η απόκτηση ειδικών δεδομένων (με διεξαγωγή εργαστηριακών πειραμάτων ή συγκέντρωση δεδομένων
							πεδίου ή αποτελέσματα υπολογιστικών προσομοιώσεων).
						</li>
						<li>
							Η λογική επεξεργασία (π.χ. επεξεργασία συγκεντρωμένων δεδομένων, πειραματικών αποτελεσμάτων,
							αποτελεσμάτων υπολογιστικών προσομοιώσεων, αξιολόγηση και σύγκριση αποτελεσμάτων, σύγκριση με
							διαθέσιμα αποτελέσματα της βιβλιογραφίας).
						</li>
						<li>
							Η δομή της Δ.Ε. και η γραπτή παρουσίασή της, π.χ. η συνοχή του κειμένου, η σωστή χρήση της
							ορολογίας και της γλώσσας, η ακριβής διατύπωση των εννοιών, η επιστημονικά ορθή τεκμηρίωση των
							συμπερασμάτων κ.λπ.
						</li>
						<li>Η πρωτοτυπία της Δ.Ε.</li>

						<li>Ο ζήλος και οι πρωτοβουλίες του φοιτητή.</li>

						<li>Η προφορική παρουσίαση της Δ.Ε. και η απάντηση στις ερωτήσεις της εξεταστικής επιτροπής.</li>
					</ul>
					<br />
					Ανάλογα με τη φύση του θέματος, κάθε μέλος της εξεταστικής επιτροπής συνεκτιμά τα παραπάνω κριτήρια
					και αποδίδει βαθμό στη Δ.Ε.. Η τελική βαθμολογία της Δ.Ε. προκύπτει ως ο μέσος όρος των τελικών
					βαθμών των τριών εξεταστών, στρογγυλοποιούμενος προς την πλησιέστερη ακέραια ή μισή μονάδα, με
					κατώτερο βαθμό επιτυχίας το 5,5.
				</AccordionContent>
			</AccordionItem>
		</Accordion>
	)
}

export default ThesisRule
