import React from 'react'
import { Accordion, AccordionContent, AccordionItem, AccordionTrigger } from '@/components/ui/accordion'

const ThesisInfo = () => {
	return (
		<Accordion type='single' collapsible className='w-full my-4'>
			<AccordionItem value='item-1'>
				<AccordionTrigger>Περιεχόμενο Διπλωματικής</AccordionTrigger>
				<AccordionContent>
					Η Διπλωματική εργασία (ΔΕ) είναι μία εκτεταμένη αναλυτική ή συνθετική εργασία που εκπονείται από τους
					τελειόφοιτους φοιτητές στο τέλος των σπουδών τους με σκοπό την ολοκλήρωση των γνώσεων τους και την
					παρουσίαση των ικανοτήτων τους στην επεξεργασία αυτοτελών θεμάτων της Επιστήμης του Ηλεκτρολόγου
					Μηχανικού και Μηχανικού Υπολογιστών. Επισημαίνεται η σημασία της ΔΕ τόσο ως κορύφωσης της πολύχρονης
					προσπάθειας κάθε φοιτητή όσο και ως τελευταίου σταδίου για τη δημιουργία ενός Μηχανικού και
					επιστήμονα και την ενσωμάτωσή του στο χώρο της εργασίας και της κοινωνίας γενικότερα. <br />
					Κάθε σπουδαστής, στο πλαίσιο ενός εκ των μαθημάτων του προγράμματος σπουδών, επιλέγει το θέμα στο
					οποίο θα εκπονήσει ΔΕ. Τα θέματα αφορούν στο ευρύτερο πεδίο της επιστήμης του ΗΜΜΥ, σε θεωρητικά,
					υπολογιστικά και πειραματικά αντικείμενα ενδιαφέροντος. Το περιεχόμενο της ΔΕ διαμορφώνεται ανάλογα
					με το υπό μελέτη ειδικό θέμα. Ενδεικτικά αναφέρονται τα βασικά στάδια για την επιτυχή ολοκλήρωση της
					ΔΕ:
					<br />
					<ul className='ml-6 list-disc [&>li]:mt-2'>
						<li>Ανάλυση και κατανόηση του υπό μελέτη ειδικού θέματος</li>
						<li>Κριτική επισκόπηση της σχετικής βιβλιογραφίας</li>
						<li>
							Οργάνωση και σχεδιασμός ερευνητικής προσέγγισης και των απαιτούμενων βημάτων για την ολοκλήρωση
							του θέματος
						</li>
						<li>Τεχνική και θεωρητική τεκμηρίωση της μεθοδολογίας επίλυσης</li>
						<li>Ολοκλήρωση των απαιτούμενων βημάτων επίλυσης του θέματος</li>

						<li>Ανάλυση των αποτελεσμάτων και εξαγωγή συμπερασμάτων</li>
						<li>Συγγραφή ολοκληρωμένου δοκιμίου</li>
						<li>Δημόσια υποστήριξη ενώπιον της τριμελούς εξεταστικής επιτροπής.</li>
					</ul>
				</AccordionContent>
			</AccordionItem>
			<AccordionItem value='item-2'>
				<AccordionTrigger>Μαθησιακά Αποτελέσματα</AccordionTrigger>
				<AccordionContent>
					Με την εκπόνηση της ΔΕ, ο/η φοιτητής/τρια αποκτά γνώση εμβάθυνσης σε πεδίο του ειδικότερου
					ενδιαφέροντός του/της, η οποία βασίζεται στο υπόβαθρο γνώσεων και δεξιοτήτων που έχει αποκτήσει κατά
					τη διάρκεια των σπουδών του/της. Επιπλέον, υπό την καθοδήγηση του επιβλέποντα, ολοκληρώνει την
					απόκτηση εξειδικευμένων νοητικών και πρακτικών δεξιοτήτων επίλυσης προβλημάτων, οι οποίες απαιτούνται
					στην έρευνα ή/και στην καινοτομία προκειμένου να αναπτυχθούν νέες γνώσεις και διαδικασίες με άξονα
					την επιστήμη του ΗΜΜΥ. Είναι σε θέση να συνδυάζει γνώσεις και να αξιοποιεί τεχνογνωσία για να επιλύει
					πολύπλοκα προβλήματα σε εφαρμογές, ή νέα άγνωστα προβλήματα ευρύτερου ή διεπιστημονικού πλαισίου
					συναφούς με την επιστήμη του ΗΜΜΥ, με τρόπο αυτοδύναμο και αυτόνομο. Με την ολοκλήρωση της ΔΕ, ο/η
					φοιτητής/τρια πρέπει να μπορεί:
					<ul className='ml-6 list-disc [&>li]:mt-2'>
						<li>
							Να αναγνωρίζει με σαφήνεια τα όρια ενός προβλήματος και να διακρίνει με πληρότητα όλες τις κύριες
							και δευτερεύουσες συνιστώσες του, εστιάζοντας στα ουσιαστικότερα σημεία για την επίλυσή του
						</li>
						<li>
							Να εξετάζει με κριτικό και συνθετικό πνεύμα τη βιβλιογραφία σε μια συγκεκριμένη θεματική περιοχή
						</li>
						<li>Να αναπτύσσει ερευνητική μεθοδολογία και να οργανώνει σχέδιο υλοποίησής της</li>
						<li>
							Να αξιολογεί την προσέγγιση/μεθοδολογία που προτείνει, τοποθετώντας την σε ένα πλαίσιο σύγκρισης,
							τεκμηριώνοντας τις απόψεις και τις επιλογές του/της
						</li>
						<li>
							Να αξιολογεί την αξιοπιστία και την εγκυρότητα της λύσης που επιτυγχάνει στο υπό μελέτη πρόβλημα
						</li>

						<li>Να συντάσσει ένα πλήρες επιστημονικό/τεχνικό δοκίμιο</li>
						<li>
							Να κοινοποιεί με σαφήνεια και αποτελεσματικότητα τα συμπεράσματά του/της, καθώς και τη γνώση και
							το σκεπτικό στο οποίο βασίζονται.
						</li>
					</ul>{' '}
				</AccordionContent>
			</AccordionItem>
			<AccordionItem value='item-3'>
				<AccordionTrigger>Αξιολόγηση</AccordionTrigger>
				<AccordionContent>
					<strong>Γλώσσα αξιολόγησης</strong>
					<br />
					<br />Η διπλωματική εργασία συγγράφεται στην ελληνική γλώσσα. Ο φοιτητής μπορεί παράλληλα να
					καταθέσει στην τριμελή επιτροπή εξέτασης προς έγκριση και αγγλικό κείμενο, αν το επιθυμεί. Η τριμελής
					επιτροπή εξετάζει το κείμενο της διπλωματικής ως προς την πληρότητα, την αυτοτέλεια και τη δομή του,
					καθώς και το προαιρετικό αγγλικό κείμενο και στη συνέχεια εγκρίνει την ανάρτηση των κειμένων στο
					σύστημα ηλεκτρονικής αρχειοθέτησης της Σχολής - ΑΡΤΕΜΙΣ.
					<br />
					<br />
					<strong>Μέθοδοι αξιολόγησης</strong>
					<br />
					<br />
					Κατάθεση γραπτού δοκιμίου - Παρουσίαση και προφορική εξέταση από τριμελή εξεταστική επιτροπή. Ο
					τελικός βαθμός προκύπτει ως ο μέσος όρος του βαθμού που αποδίδεται από κάθε μέλος της επιτροπής.
				</AccordionContent>
			</AccordionItem>
		</Accordion>
	)
}

export default ThesisInfo
